// src/compiler/index.ts
import { SIGNATURES } from './signatures/index';

export const useCompiler = () => {
  const compile = (rawData: any) => {
    // 1. Всегда выводим в консоль, что реально прилетает из Blockly
    console.log("🚀 ШЛЮЗ ПОЙМАЛ ПОТОК:", rawData);
    console.log("🚀 объект:", SIGNATURES);
    // 2. ВРЕМЕННЫЙ ПРЕДОХРАНИТЕЛЬ:
    // Если структура данных не похожа на наш готовый сайт (например, нет rowId),
    // возвращаем пустой массив, чтобы SitePreview не сломался.
    if (Array.isArray(rawData) && rawData.length > 0 && !rawData[0].rowId) {
       console.warn("⚠️ Это сырые данные от Blockly. Пока не рендерим их.");
       return []; 
    }

    // Пока шлюз просто пропускает данные, если они уже валидны
    return rawData; 
  };

  return { compile };
};